-- tutorial popup definitions
-- format: {name = { { "text to show to user", { highlight_x, highlight_y, highlight_size } } } }
-- the highlight are fractions of the screen (so 0..1) - set to 0 to disable
-- text supports $controlName escapes which will be replaced by the key bound to that control

{
   intro_help = {
	  { "我想起来了...", 0 }
      { "战争吗？", 0},
      { "...", 0},
	  { "我果然还是逃跑了", 0},
	  { "...", 0},
      { "^2AI:^7这里存在者其他文明，或许友善，或许敌对。", {0.075, 0.125, 0.075} },
      { "^2AI:^7而你，必须找到<默示录>以回到之前的宇宙，拯救你的族人。", 0 } ,
      { "^2AI:^7先进的时间回溯技术可以使你免于死亡——对于目前这个宇宙来说。", {0.9, 0.1, 0.1} }
      { "^2AI:^7这个宇宙必然是孤独的，其余的舰船不过是AI，这是唯一的真相。", 0}
      { "^2AI:^7用’$viewSelector’来编辑飞船，以更好保护自己。", 0 } 
	  { "看来也只能这样了...", 0},},
	  
   intro2_help = {
      { "^2【链接成功】", 0}
      { "^4...", {0.9, 0.1, 0.1} }
      { "^4？？？：^7有人吗？", 0}
      { "^3我：^7你是咖喱星的居民？", 0 } 
      { "^4？？？：^7谢天谢地，终于有人回应了！我是Master——", 0 }
	  { "^3我：^7Master?我好像有在哪听到这个名字。我的头好痛。", 0 }
	  { "^3我：^7我叫/p。", 0 }
	  { "^4Master：^7/p——？", 0},
	  { "^1【链接中断】", 0}
	  },

   res_full_help = {
      { "飞船^6R^7载荷已满。增加资源携带器以增大荷载量，或靠近生产点飞行，用^6R^7换取^3C^7。", {0.05, 0.25, 0.05} } },

   constructor_popup_help = {
      { "从元件板上拖动新模块。" , {0.85, 0.6, 0.25} },
      { "’^5P^7’的值限制着飞船的功能。", {0.05, 0.95, 0.05} },
      { "在“帮助”菜单中查看键盘命令， 包括方块如何翻转、 改变方块尺寸等。 ", {0.025, 0.025, 0.025} },
      { "完成后退出， 直接改动武器绑定信息不会被保存， 需要修改飞船上的模块或名字等。", {0.875, 0.05, 0.05} } },

   upgrade_help = {
      { "增加^5P^7以建造更大的飞船。", { 0.25, 0.75, 0.1 } }, -- overridden in code
   },

   intro_gravity = {
      { "*围绕*恒星向轨道推进。加速将增加\n
你的轨道大小，减速将减小轨道大小。 ", 0 },
   },
}
